SpenceKonde/megaTinyCore/megaavr/extras/ioheaders/iotn424.h
/* ADC PGA Sample Duration select */
typedef enum ADC_ADCPGASAMPDUR_enum
{
    ADC_ADCPGASAMPDUR_6CLK_gc = (0x00<<1),  /* 6 ADC cycles */
    ADC_ADCPGASAMPDUR_15CLK_gc = (0x01<<1),  /* 15 ADC cycles */
    ADC_ADCPGASAMPDUR_20CLK_gc = (0x02<<1),  /* 20 ADC cycles */
    ADC_ADCPGASAMPDUR_32CLK_gc = (0x03<<1),  /* 32 ADC cycles */
} ADC_ADCPGASAMPDUR_t;

/* Gain select */
typedef enum ADC_GAIN_enum
{
    ADC_GAIN_1X_gc = (0x00<<5),  /* 1X Gain */
    ADC_GAIN_2X_gc = (0x01<<5),  /* 2X Gain */
    ADC_GAIN_4X_gc = (0x02<<5),  /* 4X Gain */
    ADC_GAIN_8X_gc = (0x03<<5),  /* 8X Gain */
    ADC_GAIN_16X_gc = (0x04<<5),  /* 16X Gain */
} ADC_GAIN_t;

/* Mode select */
typedef enum ADC_MODE_enum
{
    ADC_MODE_SINGLE_8BIT_gc = (0x00<<4),  /* Single Conversion 8-bit */
    ADC_MODE_SINGLE_12BIT_gc = (0x01<<4),  /* Single Conversion 12-bit */
    ADC_MODE_SERIES_gc = (0x02<<4),  /* Series Accumulation */
    ADC_MODE_SERIES_SCALING_gc = (0x03<<4),  /* Series Accumulation with Scaling */
    ADC_MODE_BURST_gc = (0x04<<4),  /* Burst Accumulation */
    ADC_MODE_BURST_SCALING_gc = (0x05<<4),  /* Burst Accumulation with Scaling */
} ADC_MODE_t;

/* Analog Channel Selection Bits select */
typedef enum ADC_MUXNEG_enum
{
    ADC_MUXNEG_AIN1_gc = (0x01<<0),  /* ADC input pin 1 */
    ADC_MUXNEG_AIN2_gc = (0x02<<0),  /* ADC input pin 2 */
    ADC_MUXNEG_AIN3_gc = (0x03<<0),  /* ADC input pin 3 */
    ADC_MUXNEG_AIN4_gc = (0x04<<0),  /* ADC input pin 4 */
    ADC_MUXNEG_AIN5_gc = (0x05<<0),  /* ADC input pin 5 */
    ADC_MUXNEG_AIN6_gc = (0x06<<0),  /* ADC input pin 6 */
    ADC_MUXNEG_AIN7_gc = (0x07<<0),  /* ADC input pin 7 */
    ADC_MUXNEG_GND_gc = (0x30<<0),  /* Ground */
    ADC_MUXNEG_VDDDIV10_gc = (0x31<<0),  /* VDD/10 */
    ADC_MUXNEG_DACREF0_gc = (0x33<<0),  /* DACREF from AC0 */
} ADC_MUXNEG_t;

/* Analog Channel Selection Bits select */
typedef enum ADC_MUXPOS_enum
{
    ADC_MUXPOS_AIN1_gc = (0x01<<0),  /* ADC input pin 1 */
    ADC_MUXPOS_AIN2_gc = (0x02<<0),  /* ADC input pin 2 */
    ADC_MUXPOS_AIN3_gc = (0x03<<0),  /* ADC input pin 3 */
    ADC_MUXPOS_AIN4_gc = (0x04<<0),  /* ADC input pin 4 */
    ADC_MUXPOS_AIN5_gc = (0x05<<0),  /* ADC input pin 5 */
    ADC_MUXPOS_AIN6_gc = (0x06<<0),  /* ADC input pin 6 */
    ADC_MUXPOS_AIN7_gc = (0x07<<0),  /* ADC input pin 7 */
    ADC_MUXPOS_AIN10_gc = (0x0A<<0),  /* ADC input pin 10 */
    ADC_MUXPOS_AIN11_gc = (0x0B<<0),  /* ADC input pin 11 */
    ADC_MUXPOS_GND_gc = (0x30<<0),  /* Ground */
    ADC_MUXPOS_VDDDIV10_gc = (0x31<<0),  /* VDD/10 */
    ADC_MUXPOS_TEMPSENSE_gc = (0x32<<0),  /* Temperature sensor */
    ADC_MUXPOS_DACREF0_gc = (0x33<<0),  /* DACREF from AC0 */
} ADC_MUXPOS_t;

/* PGA BIAS Select select */
typedef enum ADC_PGABIASSEL_enum
{
    ADC_PGABIASSEL_1X_gc = (0x00<<3),  /* 1x BIAS current */
    ADC_PGABIASSEL_3_4X_gc = (0x01<<3),  /* 3/4x BIAS current */
    ADC_PGABIASSEL_1_2X_gc = (0x02<<3),  /* 1/2x BIAS current */
    ADC_PGABIASSEL_1_4X_gc = (0x03<<3),  /* 1/4x BIAS current */
} ADC_PGABIASSEL_t;

/* Prescaler Value select */
typedef enum ADC_PRESC_enum
{
    ADC_PRESC_DIV2_gc = (0x00<<0),  /* System clock divided by 2 */
    ADC_PRESC_DIV4_gc = (0x01<<0),  /* System clock divided by 4 */
    ADC_PRESC_DIV6_gc = (0x02<<0),  /* System clock divided by 6 */
    ADC_PRESC_DIV8_gc = (0x03<<0),  /* System clock divided by 8 */
    ADC_PRESC_DIV10_gc = (0x04<<0),  /* System clock divided by 10 */
    ADC_PRESC_DIV12_gc = (0x05<<0),  /* System clock divided by 12 */
    ADC_PRESC_DIV14_gc = (0x06<<0),  /* System clock divided by 14 */
    ADC_PRESC_DIV16_gc = (0x07<<0),  /* System clock divided by 16 */
    ADC_PRESC_DIV20_gc = (0x08<<0),  /* System clock divided by 20 */
    ADC_PRESC_DIV24_gc = (0x09<<0),  /* System clock divided by 24 */
    ADC_PRESC_DIV28_gc = (0x0A<<0),  /* System clock divided by 28 */
    ADC_PRESC_DIV32_gc = (0x0B<<0),  /* System clock divided by 32 */
    ADC_PRESC_DIV40_gc = (0x0C<<0),  /* System clock divided by 40 */
    ADC_PRESC_DIV48_gc = (0x0D<<0),  /* System clock divided by 48 */
    ADC_PRESC_DIV56_gc = (0x0E<<0),  /* System clock divided by 56 */
    ADC_PRESC_DIV64_gc = (0x0F<<0),  /* System clock divided by 64 */
} ADC_PRESC_t;

/* Reference select select */
typedef enum ADC_REFSEL_enum
{
    ADC_REFSEL_VDD_gc = (0x00<<0),  /* VDD */
    ADC_REFSEL_VREFA_gc = (0x02<<0),  /* External Reference */
    ADC_REFSEL_1024MV_gc = (0x04<<0),  /* Internal 1.024V Reference */
    ADC_REFSEL_2048MV_gc = (0x05<<0),  /* Internal 2.048V Reference */
    ADC_REFSEL_2500MV_gc = (0x06<<0),  /* Internal 2.5V Reference */
    ADC_REFSEL_4096MV_gc = (0x07<<0),  /* Internal 4.096V Reference */
} ADC_REFSEL_t;

/* Sample numbers select */
typedef enum ADC_SAMPNUM_enum
{
    ADC_SAMPNUM_NONE_gc = (0x00<<0),  /* No accumulation */
    ADC_SAMPNUM_ACC2_gc = (0x01<<0),  /* 2 samples accumulation */
    ADC_SAMPNUM_ACC4_gc = (0x02<<0),  /* 4 samples accumulation */
    ADC_SAMPNUM_ACC8_gc = (0x03<<0),  /* 8 samples accumulation */
    ADC_SAMPNUM_ACC16_gc = (0x04<<0),  /* 16 samples accumulation */
    ADC_SAMPNUM_ACC32_gc = (0x05<<0),  /* 32 samples accumulation */
    ADC_SAMPNUM_ACC64_gc = (0x06<<0),  /* 64 samples accumulation */
    ADC_SAMPNUM_ACC128_gc = (0x07<<0),  /* 128 samples accumulation */
    ADC_SAMPNUM_ACC256_gc = (0x08<<0),  /* 256 samples accumulation */
    ADC_SAMPNUM_ACC512_gc = (0x09<<0),  /* 512 samples accumulation */
    ADC_SAMPNUM_ACC1024_gc = (0x0A<<0),  /* 1024 samples accumulation */
} ADC_SAMPNUM_t;

/* Start command select */
typedef enum ADC_START_enum
{
    ADC_START_STOP_gc = (0x00<<0),  /* Stop an ongoing conversion */
    ADC_START_IMMEDIATE_gc = (0x01<<0),  /* Start immediately */
    ADC_START_MUXPOS_WRITE_gc = (0x02<<0),  /* Start on MUXPOS write */
    ADC_START_MUXNEG_WRITE_gc = (0x03<<0),  /* Start on MUXNEG write */
    ADC_START_EVENT_TRIGGER_gc = (0x04<<0),  /* Start on event */
} ADC_START_t;

/* VIA select */
typedef enum ADC_VIA_enum
{
    ADC_VIA_ADC_gc = (0x00<<6),  /* Via ADC */
    ADC_VIA_PGA_gc = (0x01<<6),  /* Via PGA */
} ADC_VIA_t;

/* Window Comparator Mode select */
typedef enum ADC_WINCM_enum
{
    ADC_WINCM_NONE_gc = (0x00<<0),  /* No Window Comparison */
    ADC_WINCM_BELOW_gc = (0x01<<0),  /* Below Window */
    ADC_WINCM_ABOVE_gc = (0x02<<0),  /* Above Window */
    ADC_WINCM_INSIDE_gc = (0x03<<0),  /* Inside Window */
    ADC_WINCM_OUTSIDE_gc = (0x04<<0),  /* Outside Window */
} ADC_WINCM_t;

/* Window Mode Source select */
typedef enum ADC_WINSRC_enum
{
    ADC_WINSRC_RESULT_gc = (0x00<<3),  /* Result register */
    ADC_WINSRC_SAMPLE_gc = (0x01<<3),  /* Sample register */
} ADC_WINSRC_t;

