SpenceKonde/megaTinyCore/megaavr/extras/ioheaders/iotn424.h
/* ADC.DBGCTRL  bit masks and bit positions */
#define ADC_DBGRUN_bm  0x01  /* Debug run bit mask. */
#define ADC_DBGRUN_bp  0  /* Debug run bit position. */

/* ADC.CTRLE  bit masks and bit positions */
#define ADC_SAMPDUR_gm  0xFF  /* Sampling time group mask. */
#define ADC_SAMPDUR_gp  0  /* Sampling time group position. */
#define ADC_SAMPDUR0_bm  (1<<0)  /* Sampling time bit 0 mask. */
#define ADC_SAMPDUR0_bp  0  /* Sampling time bit 0 position. */
#define ADC_SAMPDUR1_bm  (1<<1)  /* Sampling time bit 1 mask. */
#define ADC_SAMPDUR1_bp  1  /* Sampling time bit 1 position. */
#define ADC_SAMPDUR2_bm  (1<<2)  /* Sampling time bit 2 mask. */
#define ADC_SAMPDUR2_bp  2  /* Sampling time bit 2 position. */
#define ADC_SAMPDUR3_bm  (1<<3)  /* Sampling time bit 3 mask. */
#define ADC_SAMPDUR3_bp  3  /* Sampling time bit 3 position. */
#define ADC_SAMPDUR4_bm  (1<<4)  /* Sampling time bit 4 mask. */
#define ADC_SAMPDUR4_bp  4  /* Sampling time bit 4 position. */
#define ADC_SAMPDUR5_bm  (1<<5)  /* Sampling time bit 5 mask. */
#define ADC_SAMPDUR5_bp  5  /* Sampling time bit 5 position. */
#define ADC_SAMPDUR6_bm  (1<<6)  /* Sampling time bit 6 mask. */
#define ADC_SAMPDUR6_bp  6  /* Sampling time bit 6 position. */
#define ADC_SAMPDUR7_bm  (1<<7)  /* Sampling time bit 7 mask. */
#define ADC_SAMPDUR7_bp  7  /* Sampling time bit 7 position. */

/* ADC.CTRLF  bit masks and bit positions */
#define ADC_SAMPNUM_gm  0x0F  /* Sample numbers group mask. */
#define ADC_SAMPNUM_gp  0  /* Sample numbers group position. */
#define ADC_SAMPNUM0_bm  (1<<0)  /* Sample numbers bit 0 mask. */
#define ADC_SAMPNUM0_bp  0  /* Sample numbers bit 0 position. */
#define ADC_SAMPNUM1_bm  (1<<1)  /* Sample numbers bit 1 mask. */
#define ADC_SAMPNUM1_bp  1  /* Sample numbers bit 1 position. */
#define ADC_SAMPNUM2_bm  (1<<2)  /* Sample numbers bit 2 mask. */
#define ADC_SAMPNUM2_bp  2  /* Sample numbers bit 2 position. */
#define ADC_SAMPNUM3_bm  (1<<3)  /* Sample numbers bit 3 mask. */
#define ADC_SAMPNUM3_bp  3  /* Sample numbers bit 3 position. */
#define ADC_LEFTADJ_bm  0x10  /* Left adjust bit mask. */
#define ADC_LEFTADJ_bp  4  /* Left adjust bit position. */
#define ADC_FREERUN_bm  0x20  /* Free running mode bit mask. */
#define ADC_FREERUN_bp  5  /* Free running mode bit position. */

/* ADC.COMMAND  bit masks and bit positions */
#define ADC_START_gm  0x07  /* Start command group mask. */
#define ADC_START_gp  0  /* Start command group position. */
#define ADC_START0_bm  (1<<0)  /* Start command bit 0 mask. */
#define ADC_START0_bp  0  /* Start command bit 0 position. */
#define ADC_START1_bm  (1<<1)  /* Start command bit 1 mask. */
#define ADC_START1_bp  1  /* Start command bit 1 position. */
#define ADC_START2_bm  (1<<2)  /* Start command bit 2 mask. */
#define ADC_START2_bp  2  /* Start command bit 2 position. */
#define ADC_MODE_gm  0x70  /* Mode group mask. */
#define ADC_MODE_gp  4  /* Mode group position. */
#define ADC_MODE0_bm  (1<<4)  /* Mode bit 0 mask. */
#define ADC_MODE0_bp  4  /* Mode bit 0 position. */
#define ADC_MODE1_bm  (1<<5)  /* Mode bit 1 mask. */
#define ADC_MODE1_bp  5  /* Mode bit 1 position. */
#define ADC_MODE2_bm  (1<<6)  /* Mode bit 2 mask. */
#define ADC_MODE2_bp  6  /* Mode bit 2 position. */
#define ADC_DIFF_bm  0x80  /* Differential mode bit mask. */
#define ADC_DIFF_bp  7  /* Differential mode bit position. */

/* ADC.PGACTRL  bit masks and bit positions */
#define ADC_PGAEN_bm  0x01  /* PGA Enable bit mask. */
#define ADC_PGAEN_bp  0  /* PGA Enable bit position. */
#define ADC_ADCPGASAMPDUR_gm  0x06  /* ADC PGA Sample Duration group mask. */
#define ADC_ADCPGASAMPDUR_gp  1  /* ADC PGA Sample Duration group position. */
#define ADC_ADCPGASAMPDUR0_bm  (1<<1)  /* ADC PGA Sample Duration bit 0 mask. */
#define ADC_ADCPGASAMPDUR0_bp  1  /* ADC PGA Sample Duration bit 0 position. */
#define ADC_ADCPGASAMPDUR1_bm  (1<<2)  /* ADC PGA Sample Duration bit 1 mask. */
#define ADC_ADCPGASAMPDUR1_bp  2  /* ADC PGA Sample Duration bit 1 position. */
#define ADC_PGABIASSEL_gm  0x18  /* PGA BIAS Select group mask. */
#define ADC_PGABIASSEL_gp  3  /* PGA BIAS Select group position. */
#define ADC_PGABIASSEL0_bm  (1<<3)  /* PGA BIAS Select bit 0 mask. */
#define ADC_PGABIASSEL0_bp  3  /* PGA BIAS Select bit 0 position. */
#define ADC_PGABIASSEL1_bm  (1<<4)  /* PGA BIAS Select bit 1 mask. */
#define ADC_PGABIASSEL1_bp  4  /* PGA BIAS Select bit 1 position. */
#define ADC_GAIN_gm  0xE0  /* Gain group mask. */
#define ADC_GAIN_gp  5  /* Gain group position. */
#define ADC_GAIN0_bm  (1<<5)  /* Gain bit 0 mask. */
#define ADC_GAIN0_bp  5  /* Gain bit 0 position. */
#define ADC_GAIN1_bm  (1<<6)  /* Gain bit 1 mask. */
#define ADC_GAIN1_bp  6  /* Gain bit 1 position. */
#define ADC_GAIN2_bm  (1<<7)  /* Gain bit 2 mask. */
#define ADC_GAIN2_bp  7  /* Gain bit 2 position. */

/* ADC.MUXPOS  bit masks and bit positions */
#define ADC_MUXPOS_gm  0x3F  /* Analog Channel Selection Bits group mask. */
#define ADC_MUXPOS_gp  0  /* Analog Channel Selection Bits group position. */
#define ADC_MUXPOS0_bm  (1<<0)  /* Analog Channel Selection Bits bit 0 mask. */
#define ADC_MUXPOS0_bp  0  /* Analog Channel Selection Bits bit 0 position. */
#define ADC_MUXPOS1_bm  (1<<1)  /* Analog Channel Selection Bits bit 1 mask. */
#define ADC_MUXPOS1_bp  1  /* Analog Channel Selection Bits bit 1 position. */
#define ADC_MUXPOS2_bm  (1<<2)  /* Analog Channel Selection Bits bit 2 mask. */
#define ADC_MUXPOS2_bp  2  /* Analog Channel Selection Bits bit 2 position. */
#define ADC_MUXPOS3_bm  (1<<3)  /* Analog Channel Selection Bits bit 3 mask. */
#define ADC_MUXPOS3_bp  3  /* Analog Channel Selection Bits bit 3 position. */
#define ADC_MUXPOS4_bm  (1<<4)  /* Analog Channel Selection Bits bit 4 mask. */
#define ADC_MUXPOS4_bp  4  /* Analog Channel Selection Bits bit 4 position. */
#define ADC_MUXPOS5_bm  (1<<5)  /* Analog Channel Selection Bits bit 5 mask. */
#define ADC_MUXPOS5_bp  5  /* Analog Channel Selection Bits bit 5 position. */
#define ADC_VIA_gm  0xC0  /* VIA group mask. */
#define ADC_VIA_gp  6  /* VIA group position. */
#define ADC_VIA0_bm  (1<<6)  /* VIA bit 0 mask. */
#define ADC_VIA0_bp  6  /* VIA bit 0 position. */
#define ADC_VIA1_bm  (1<<7)  /* VIA bit 1 mask. */
#define ADC_VIA1_bp  7  /* VIA bit 1 position. */

/* ADC.MUXNEG  bit masks and bit positions */
#define ADC_MUXNEG_gm  0x3F  /* Analog Channel Selection Bits group mask. */
#define ADC_MUXNEG_gp  0  /* Analog Channel Selection Bits group position. */
#define ADC_MUXNEG0_bm  (1<<0)  /* Analog Channel Selection Bits bit 0 mask. */
#define ADC_MUXNEG0_bp  0  /* Analog Channel Selection Bits bit 0 position. */
#define ADC_MUXNEG1_bm  (1<<1)  /* Analog Channel Selection Bits bit 1 mask. */
#define ADC_MUXNEG1_bp  1  /* Analog Channel Selection Bits bit 1 position. */
#define ADC_MUXNEG2_bm  (1<<2)  /* Analog Channel Selection Bits bit 2 mask. */
#define ADC_MUXNEG2_bp  2  /* Analog Channel Selection Bits bit 2 position. */
#define ADC_MUXNEG3_bm  (1<<3)  /* Analog Channel Selection Bits bit 3 mask. */
#define ADC_MUXNEG3_bp  3  /* Analog Channel Selection Bits bit 3 position. */
#define ADC_MUXNEG4_bm  (1<<4)  /* Analog Channel Selection Bits bit 4 mask. */
#define ADC_MUXNEG4_bp  4  /* Analog Channel Selection Bits bit 4 position. */
#define ADC_MUXNEG5_bm  (1<<5)  /* Analog Channel Selection Bits bit 5 mask. */
#define ADC_MUXNEG5_bp  5  /* Analog Channel Selection Bits bit 5 position. */
/* ADC_VIA  is already defined. */



/* ADC.TEMP0  bit masks and bit positions */
#define ADC_TEMP_gm  0xFF  /* Temporary group mask. */
#define ADC_TEMP_gp  0  /* Temporary group position. */
#define ADC_TEMP0_bm  (1<<0)  /* Temporary bit 0 mask. */
#define ADC_TEMP0_bp  0  /* Temporary bit 0 position. */
#define ADC_TEMP1_bm  (1<<1)  /* Temporary bit 1 mask. */
#define ADC_TEMP1_bp  1  /* Temporary bit 1 position. */
#define ADC_TEMP2_bm  (1<<2)  /* Temporary bit 2 mask. */
#define ADC_TEMP2_bp  2  /* Temporary bit 2 position. */
#define ADC_TEMP3_bm  (1<<3)  /* Temporary bit 3 mask. */
#define ADC_TEMP3_bp  3  /* Temporary bit 3 position. */
#define ADC_TEMP4_bm  (1<<4)  /* Temporary bit 4 mask. */
#define ADC_TEMP4_bp  4  /* Temporary bit 4 position. */
#define ADC_TEMP5_bm  (1<<5)  /* Temporary bit 5 mask. */
#define ADC_TEMP5_bp  5  /* Temporary bit 5 position. */
#define ADC_TEMP6_bm  (1<<6)  /* Temporary bit 6 mask. */
#define ADC_TEMP6_bp  6  /* Temporary bit 6 position. */
#define ADC_TEMP7_bm  (1<<7)  /* Temporary bit 7 mask. */
#define ADC_TEMP7_bp  7  /* Temporary bit 7 position. */

/* ADC.TEMP1  bit masks and bit positions */
/* ADC_TEMP  is already defined. */

